QGDsolver/tutorials/reactingQGDFoam/1D/Lax/constant/reactions
species
(
    O2
    N2
);

reactions
{
}
